'''
ในการเข้าใช้งานโปรแกรมให้ผู้ล็อคอินโดยใช้ Username และ Password(ผู้เรียนกำหนดเอง)

หากสำเร็จ โปรแกรมจะขึ้นหน้าต้อนรับและแสดงรายการสินค้าพร้อมราคา (ผู้เรียนกำหนดเอง)

เมื่อเลือกสินค้าที่ต้องการเรียบร้อยแล้ว โปรแกรมจะถามจำนวนที่ต้องการซื้อ

หลังจากผู้ซื้อเลือกเรียบร้อยแล้ว โปรแกรมจะทำการแสดงสรุปราคารวมของรายการสั่งซื้อทั้งหมด
'''
Username = int(input())
Password = int(input())
print("ยินดีต้อนรับ")
print("แสดงรายการสินค้า")
print(Apple ราคา 10 บาท ต่อ กิโลกรัม)
print(Orange ราคา 10 บาท ต่อ กิโลกรัม)
print(Mango ราคา 10 บาท ต่อ กิโลกรัม)
