'''
ในการเข้าใช้งานโปรแกรมให้ผู้ล็อคอินโดยใช้ Username และ Password(ผู้เรียนกำหนดเอง)
หากสำเร็จ โปรแกรมจะขึ้นหน้าต้อนรับและแสดงรายการสินค้าพร้อมราคา (ผู้เรียนกำหนดเอง)
เมื่อเลือกสินค้าที่ต้องการเรียบร้อยแล้ว โปรแกรมจะถามจำนวนที่ต้องการซื้อ
หลังจากผู้ซื้อเลือกเรียบร้อยแล้ว โปรแกรมจะทำการแสดงสรุปราคารวมของรายการสั่งซื้อทั้งหมด
'''
Username = int(input())
Password = int(input())
print("ยินดีต้อนรับ")
print("แสดงรายการสินค้า")
print(Apple ราคา 10 บาท ต่อ กิโลกรัม)
print(Orange ราคา 20 บาท ต่อ กิโลกรัม)
print(Mango ราคา 30 บาท ต่อ กิโลกรัม)
น้ำหนักสินค้า1 =int(input("กรุณาชั่งน้ำหนัก"))
น้ำหนักสินค้า2 =int(input("กรุณาชั่งน้ำหนัก"))
น้ำหนักสินค้า3 =int(input("กรุณาชั่งน้ำหนัก"))
print("รายการการสั่งซื้อสินค้า",\nint(น้ำหนักสินค้า),\nint(น้ำหนักสินค้า2),\nint(น้ำหนักสินค้า3))
print("สรุปราคารวมของรายการสั่งซื้อทั้งหมด",(น้ำหนักสินค้า1*10)+(น้ำหนักสินค้า2*20)+(น้ำหนักสินค้า3*30))
